markdownOutput/work_notes/20250919161110-gradesheet.md

# Table of Contents

1.  [What is a Gradesheet?](#org2c9b150)
    1.  [Objectives of a Gradesheet](#org67b8613)
        1.  [The amin objective is tpo be able to report data based on datasets. This differs from the dashboard in a few ways. The dashbaord give similar dat, but is less user definable. As in the Gradesheet is able to specify various fields on from the markers. BUT this can also give insights based on certain fields as well.](#orgff6c13d)
        2.  [These user specified fields, allow users to (for MVP) choose the numerator and the denominator for form the markers. Now these are base don either Marker&rsquo;s as a whole or the fields within.](#orgb603f4c)



<a id="org2c9b150"></a>

# What is a [Gradesheet](20250919161110-gradesheet.md)?


<a id="org67b8613"></a>

## Objectives of a [Gradesheet](20250919161110-gradesheet.md)


<a id="orgff6c13d"></a>

### The amin objective is tpo be able to report data based on datasets. This differs from the dashboard in a few ways. The dashbaord give similar dat, but is less user definable. As in the [Gradesheet](20250919161110-gradesheet.md) is able to specify various fields on from the markers. BUT this can also give insights based on certain fields as well.


<a id="orgb603f4c"></a>

### These user specified fields, allow users to (for MVP) choose the numerator and the denominator for form the markers. Now these are base don either Marker&rsquo;s as a whole or the fields within.

1.  Issues for MVP, we cannot have cross-domain marker fields. (ie no AIM-120 v AIM-9 markers).

2.  The issues above will be able to occur but i need to think about this in more depth to see the logic that would bet allow for this comparison.

    **\*\***

